ГТС/УТГТС/Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктСверкиВзаиморасчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизацииДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительПартнераДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымПартнера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Documents/АктСверкиВзаиморасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция формирует печатную форму документа.
//
// Параметры:
// Тип - Строка - тип печатной формы: Заказ или Счет
// МассивОбъектов - Массив - массив документов для печати
// ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
// ТабличныйДокумент
//
Функция СформироватьПечатнуюФорму(Тип, МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК Ссылка,
	|	АктСверкиВзаиморасчетов.Номер,
	|	АктСверкиВзаиморасчетов.Дата,
	|	АктСверкиВзаиморасчетов.Организация,
	|	АктСверкиВзаиморасчетов.Организация.Префикс КАК Префикс,
	|	АктСверкиВзаиморасчетов.СверкаСогласована,
	|	АктСверкиВзаиморасчетов.Партнер,
	|	АктСверкиВзаиморасчетов.Партнер.НаименованиеПолное,
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало,
	|	АктСверкиВзаиморасчетов.ОстатокНаКонец,
	|	АктСверкиВзаиморасчетов.ПредставительОрганизацииДолжность,
	|	АктСверкиВзаиморасчетов.ПредставительОрганизации,
	|	АктСверкиВзаиморасчетов.ПредставительПартнераДолжность,
	|	АктСверкиВзаиморасчетов.ПредставительПартнера,
	|	АктСверкиВзаиморасчетов.ДатаНачала,
	|	АктСверкиВзаиморасчетов.ДатаОкончания,
	|	АктСверкиВзаиморасчетов.Организация.НаименованиеПолное,
	|	АктСверкиВзаиморасчетов.ПоДаннымОрганизации.(
	|		Ссылка,
	|		НомерСтроки,
	|		Дата,
	|		Документ,
	|		Представление,
	|		Дебет,
	|		Кредит
	|	)
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить();
	Если Тип="АктСверкипЕЧ" Тогда
		Макет = Документы.АктСверкиВзаиморасчетов.ПолучитьМакет("ПФ_MXL_АктСверкиПеч");

		Иначе
	Макет = Документы.АктСверкиВзаиморасчетов.ПолучитьМакет("ПФ_MXL_АктСверки");
	КонецЕсли;
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьНачОстатки = Макет.ПолучитьОбласть("НачОстатки");
	ОбластьОбороты = Макет.ПолучитьОбласть("Обороты");
	ОбластьОборотыИтог = Макет.ПолучитьОбласть("ОборотыИтог");
	ОбластьКонОстатки = Макет.ПолучитьОбласть("КонОстатки");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Ложь;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ФИОПредставителяОрганизации = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ДанныеПечати.ПредставительОрганизации));
		ФИОПредставителяОрганизации = ?(ПустаяСтрока(ФИОПредставителяОрганизации), "_______________________", СокрЛП(ФИОПредставителяОрганизации));
		ДолжностьПредставителяОрганизации = ?(ПустаяСтрока(ДанныеПечати.ПредставительОрганизацииДолжность),"________________",СокрЛП(ДанныеПечати.ПредставительОрганизацииДолжность));
		
		ФИОПредставителяПартнера = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(ДанныеПечати.ПредставительПартнера));
		ФИОПредставителяПартнера = ?(ПустаяСтрока(ФИОПредставителяПартнера), "_______________________", СокрЛП(ФИОПредставителяПартнера));
		ДолжностьПредставителяПартнера = ?(ПустаяСтрока(ДанныеПечати.ПредставительПартнераДолжность), "________________", СокрЛП(ДанныеПечати.ПредставительПартнераДолжность));
		
		НазваниеОрганизации = СокрЛП(ДанныеПечати.ОрганизацияНаименованиеПолное);
		НазваниеПартнера = СокрЛП(ДанныеПечати.ПартнерНаименованиеПолное);
		
		ТекстЗаголовка =  "взаимных расчетов за " + ПредставлениеПериода(ДанныеПечати.ДатаНачала,КонецДня(ДанныеПечати.ДатаОкончания)) + Символы.ПС + "между " + НазваниеОрганизации + Символы.ПС + "и " + НазваниеПартнера;
		СтрЗаголовокТаблица = "Мы, нижеподписавшиеся, " + ДолжностьПредставителяОрганизации + " " + НазваниеОрганизации + " " + ФИОПредставителяОрганизации + ", с одной стороны, "	+ "и " + ДолжностьПредставителяПартнера 
						+ " " + НазваниеПартнера + " " + ФИОПредставителяПартнера + ", с другой стороны, "	+ "составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:";
						
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверки";
		
		ПараметрыШапки = Новый Структура;
		ПараметрыШапки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ПараметрыШапки.Вставить("СтрЗаголовокТаблица", СтрЗаголовокТаблица);
		ПараметрыШапки.Вставить("НазваниеОрганизации", НазваниеОрганизации);
		ПараметрыШапки.Вставить("НазваниеПартнера", НазваниеПартнера);
		ПараметрыШапки.Вставить("ВалютаДокумента", СокрЛП(ВалютаДокумента));
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		НачальныйОстатокДт = ?(ДанныеПечати.ОстатокНаНачало > 0, ДанныеПечати.ОстатокНаНачало, 0);
		НачальныйОстатокКт = ?(ДанныеПечати.ОстатокНаНачало < 0, -ДанныеПечати.ОстатокНаНачало, 0);
		
		
		ОбластьНачОстатки.Параметры.НачальныйОстатокДт = НачальныйОстатокДт;
		ОбластьНачОстатки.Параметры.НачальныйОстатокКт = НачальныйОстатокКт;
		
		Если ДанныеПечати.СверкаСогласована Тогда
			ОбластьНачОстатки.Параметры.НачальныйОстатокДтКонтр = НачальныйОстатокКт;
			ОбластьНачОстатки.Параметры.НачальныйОстатокКтКонтр = НачальныйОстатокДт;
		Иначе
			ОбластьНачОстатки.Параметры.НачальныйОстатокДтКонтр = 0;
			ОбластьНачОстатки.Параметры.НачальныйОстатокКтКонтр = 0;
		КонецЕсли;	
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		Таблица = ДанныеПечати.ПоДаннымОрганизации.Выгрузить();
		Таблица.Сортировать("НомерСтроки");
		
		НомерСтроки = 0;
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьОбороты.Параметры.ДатаДокумента = СтрокаТаблицы.Дата;
			ОбластьОбороты.Параметры.РегистраторПредставление = СтрокаТаблицы.Представление;
			ОбластьОбороты.Параметры.Дебет = СтрокаТаблицы.Дебет;
			ОбластьОбороты.Параметры.Кредит = СтрокаТаблицы.Кредит;
			
			Если ДанныеПечати.СверкаСогласована Тогда
				ОбластьОбороты.Параметры.ДатаДокументаКонтр = СтрокаТаблицы.Дата;
				ОбластьОбороты.Параметры.РегистраторПредставлениеКонтр = СтрокаТаблицы.Представление;
				ОбластьОбороты.Параметры.ДебетКонтр = СтрокаТаблицы.Кредит;
				ОбластьОбороты.Параметры.КредитКонтр = СтрокаТаблицы.Дебет;
			Иначе
				ОбластьОбороты.Параметры.ДатаДокументаКонтр = "";
				ОбластьОбороты.Параметры.РегистраторПредставлениеКонтр = "";
				ОбластьОбороты.Параметры.ДебетКонтр = 0;
				ОбластьОбороты.Параметры.КредитКонтр = 0;
			КонецЕсли;	
		
			ТабличныйДокумент.Вывести(ОбластьОбороты);

		КонецЦикла;
		
		ОбластьОборотыИтог.Параметры.ОборотДт = Таблица.Итог("Дебет");
		ОбластьОборотыИтог.Параметры.ОборотКт = Таблица.Итог("Кредит");
		
		Если ДанныеПечати.СверкаСогласована Тогда
			ОбластьОборотыИтог.Параметры.ОборотКтКонтр = Таблица.Итог("Дебет");
			ОбластьОборотыИтог.Параметры.ОборотДтКонтр = Таблица.Итог("Кредит");
		Иначе
			ОбластьОборотыИтог.Параметры.ОборотКтКонтр = 0;
			ОбластьОборотыИтог.Параметры.ОборотДтКонтр = 0;
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);

		КонечныйОстатокДт = ?(ДанныеПечати.ОстатокНаКонец > 0, ДанныеПечати.ОстатокНаКонец, 0);
		КонечныйОстатокКт = ?(ДанныеПечати.ОстатокНаКонец < 0, -ДанныеПечати.ОстатокНаКонец, 0);
		
		ОбластьКонОстатки.Параметры.КонечныйОстатокДт = КонечныйОстатокДт;
		ОбластьКонОстатки.Параметры.КонечныйОстатокКт = КонечныйОстатокКт;
		
		Если ДанныеПечати.СверкаСогласована Тогда
			ОбластьКонОстатки.Параметры.КонечныйОстатокДтКонтр = КонечныйОстатокКт;
			ОбластьКонОстатки.Параметры.КонечныйОстатокКтКонтр = КонечныйОстатокДт;
		Иначе
			ОбластьКонОстатки.Параметры.КонечныйОстатокДтКонтр = 0;
			ОбластьКонОстатки.Параметры.КонечныйОстатокКтКонтр = 0;
		КонецЕсли;	
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		ОбластьПодвал.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		ОбластьПодвал.Параметры.НазваниеПартнера = НазваниеПартнера;

		РезультатыСверки = "на " + Формат(ДанныеПечати.ДатаОкончания, "ДФ=dd.MM.yyyy") + " задолженность ";
			
	   	Если ДанныеПечати.ОстатокНаКонец > 0 Тогда
			РезультатыСверки = РезультатыСверки + "в пользу " + НазваниеОрганизации + " " + Формат(ДанныеПечати.ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " 
								+ строка(ВалютаДокумента) + " (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеПечати.ОстатокНаКонец, ВалютаДокумента) + ")";
	
	   	ИначеЕсли ДанныеПечати.ОстатокНаКонец < 0 Тогда
			РезультатыСверки = РезультатыСверки + "в пользу " + НазваниеПартнера + " " + Формат(-ДанныеПечати.ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " 
								+ строка(ВалютаДокумента) + " (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ДанныеПечати.ОстатокНаКонец, ВалютаДокумента) + ")";
	
	   	Иначе
	   		РезультатыСверки = РезультатыСверки + "отсутствует.";
		КонецЕсли;
		
		РезультатыСверкиКонтр = "";
		
		Если ДанныеПечати.СверкаСогласована Тогда
			РезультатыСверкиКонтр = "на " + Формат(ДанныеПечати.ДатаОкончания, "ДФ=dd.MM.yyyy") + " задолженность ";
			
			Если ДанныеПечати.ОстатокНаКонец > 0 Тогда
				РезультатыСверкиКонтр = РезультатыСверкиКонтр + "в пользу " + НазваниеОрганизации + " " + Формат(ДанныеПечати.ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " 
									+ СокрЛП(ВалютаДокумента) + " (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеПечати.ОстатокНаКонец, ВалютаДокумента) + ")" ;
				
			ИначеЕсли ДанныеПечати.ОстатокНаКонец < 0 Тогда
				РезультатыСверкиКонтр = РезультатыСверкиКонтр + "в пользу " + НазваниеПартнера + " " + Формат(-ДанныеПечати.ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " 
									+ строка(ВалютаДокумента) + " (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ДанныеПечати.ОстатокНаКонец, ВалютаДокумента,Ложь)+")" ;
				
			Иначе
				РезультатыСверкиКонтр = РезультатыСверкиКонтр + "отсутствует.";
			КонецЕсли;
		КонецЕсли;
		
		ОбластьПодвал.Параметры.РезультатыСверки = РезультатыСверки;
		ОбластьПодвал.Параметры.РезультатыСверкиК = РезультатыСверкиКонтр;
		ОбластьПодвал.Параметры.Должность = ДолжностьПредставителяОрганизации;
		ОбластьПодвал.Параметры.ДолжностьК = ДолжностьПредставителяПартнера;
		ОбластьПодвал.Параметры.ФИОПредставителя = "(" + ФИОПредставителяОрганизации + ")";
		ОбластьПодвал.Параметры.ФИОПредставителяК = "(" + ФИОПредставителяПартнера + ")";
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФорму()


// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати,
                 КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверки", "Акт сверки", СформироватьПечатнуюФорму("АктСверки", МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиПеч") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСверкипЕЧ", "Акт сверки", СформироватьПечатнуюФорму("АктСверкипЕЧ", МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли
